pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6035.h
/* LCDCCTL1 Control Bits */
#define LCDFRMIFG                        (0x0001)        /* LCD frame interrupt flag */
#define LCDFRMIFG_L                      (0x0001)
#define LCDFRMIFG_0                      (0x0000)        /* No interrupt pending */
#define LCDFRMIFG_1                      (0x0001)        /* Interrupt pending */
#define LCDFRMIFG_1_L                    (0x0001)
#define LCDBLKOFFIFG                     (0x0002)        /* LCD blinking interrupt flag, segments switched off */
#define LCDBLKOFFIFG_L                   (0x0002)
#define LCDBLKOFFIFG_0                   (0x0000)        /* No interrupt pending */
#define LCDBLKOFFIFG_1                   (0x0002)        /* Interrupt pending */
#define LCDBLKOFFIFG_1_L                 (0x0002)
#define LCDBLKONIFG                      (0x0004)        /* LCD blinking interrupt flag, segments switched on */
#define LCDBLKONIFG_L                    (0x0004)
#define LCDBLKONIFG_0                    (0x0000)        /* No interrupt pending */
#define LCDBLKONIFG_1                    (0x0004)        /* Interrupt pending */
#define LCDBLKONIFG_1_L                  (0x0004)
#define LCDNOCAPIFG                      (0x0008)        /* No capacitance connected interrupt flag */
#define LCDNOCAPIFG_L                    (0x0008)
#define LCDNOCAPIFG_0                    (0x0000)        /* No interrupt pending */
#define LCDNOCAPIFG_1                    (0x0008)        /* Interrupt pending */
#define LCDNOCAPIFG_1_L                  (0x0008)
#define LCDFRMIE                         (0x0100)        /* LCD frame interrupt enable */
#define LCDFRMIE_H                       (0x0001)
#define LCDFRMIE_0                       (0x0000)        /* Interrupt disabled */
#define LCDFRMIE_1                       (0x0100)        /* Interrupt enabled */
#define LCDFRMIE_1_H                     (0x0001)
#define LCDBLKOFFIE                      (0x0200)        /* LCD blinking interrupt enable, segments switched off */
#define LCDBLKOFFIE_H                    (0x0002)
#define LCDBLKOFFIE_0                    (0x0000)        /* Interrupt disabled */
#define LCDBLKOFFIE_1                    (0x0200)        /* Interrupt enabled */
#define LCDBLKOFFIE_1_H                  (0x0002)
#define LCDBLKONIE                       (0x0400)        /* LCD blinking interrupt enable, segments switched on */
#define LCDBLKONIE_H                     (0x0004)
#define LCDBLKONIE_0                     (0x0000)        /* Interrupt disabled */
#define LCDBLKONIE_1                     (0x0400)        /* Interrupt enabled */
#define LCDBLKONIE_1_H                   (0x0004)
#define LCDNOCAPIE                       (0x0800)        /* No capacitance connected interrupt enable */
#define LCDNOCAPIE_H                     (0x0008)
#define LCDNOCAPIE_0                     (0x0000)        /* Interrupt disabled */
#define LCDNOCAPIE_1                     (0x0800)        /* Interrupt enabled */
#define LCDNOCAPIE_1_H                   (0x0008)

/* LCDCBLKCTL Control Bits */
#define LCDBLKMOD                        (0x0003)        /* Blinking mode */
#define LCDBLKMOD_L                      (0x0003)
#define LCDBLKMOD0                       (0x0001)        /* Blinking mode */
#define LCDBLKMOD0_L                     (0x0001)
#define LCDBLKMOD1                       (0x0002)        /* Blinking mode */
#define LCDBLKMOD1_L                     (0x0002)
#define LCDBLKMOD_0                      (0x0000)        /* Blinking disabled */
#define LCDBLKMOD_1                      (0x0001)        /* Blinking of individual segments as enabled in blinking memory 
                                                            register LCDBMx. In mux mode >5 blinking is disabled. */
#define LCDBLKMOD_1_L                    (0x0001)
#define LCDBLKMOD_2                      (0x0002)        /* Blinking of all segments */
#define LCDBLKMOD_2_L                    (0x0002)
#define LCDBLKMOD_3                      (0x0003)        /* Switching between display contents as stored in LCDMx and 
                                                            LCDBMx memory registers. In mux mode >5 blinking is disabled. */
#define LCDBLKMOD_3_L                    (0x0003)
#define LCDBLKPRE                        (0x001c)        /* Clock pre-scaler for blinking frequency */
#define LCDBLKPRE_L                      (0x001c)
#define LCDBLKPRE0                       (0x0004)        /* Clock pre-scaler for blinking frequency */
#define LCDBLKPRE0_L                     (0x0004)
#define LCDBLKPRE1                       (0x0008)        /* Clock pre-scaler for blinking frequency */
#define LCDBLKPRE1_L                     (0x0008)
#define LCDBLKPRE2                       (0x0010)        /* Clock pre-scaler for blinking frequency */
#define LCDBLKPRE2_L                     (0x0010)
#define LCDBLKPRE_0                      (0x0000)        /* Divide by 512 */
#define LCDBLKPRE_1                      (0x0004)        /* Divide by 1024 */
#define LCDBLKPRE_1_L                    (0x0004)
#define LCDBLKPRE_2                      (0x0008)        /* Divide by 2048 */
#define LCDBLKPRE_2_L                    (0x0008)
#define LCDBLKPRE_3                      (0x000c)        /* Divide by 4096 */
#define LCDBLKPRE_3_L                    (0x000c)
#define LCDBLKPRE_4                      (0x0010)        /* Divide by 8162 */
#define LCDBLKPRE_4_L                    (0x0010)
#define LCDBLKPRE_5                      (0x0014)        /* Divide by 16384 */
#define LCDBLKPRE_5_L                    (0x0014)
#define LCDBLKPRE_6                      (0x0018)        /* Divide by 32768 */
#define LCDBLKPRE_6_L                    (0x0018)
#define LCDBLKPRE_7                      (0x001c)        /* Divide by 65536 */
#define LCDBLKPRE_7_L                    (0x001c)
#define LCDBLKPRE__512                   (0x0000)        /* Divide by 512 */
#define LCDBLKPRE__1024                  (0x0004)        /* Divide by 1024 */
#define LCDBLKPRE__1024_L                (0x0004)
#define LCDBLKPRE__2048                  (0x0008)        /* Divide by 2048 */
#define LCDBLKPRE__2048_L                (0x0008)
#define LCDBLKPRE__4096                  (0x000c)        /* Divide by 4096 */
#define LCDBLKPRE__4096_L                (0x000c)
#define LCDBLKPRE__8162                  (0x0010)        /* Divide by 8162 */
#define LCDBLKPRE__8162_L                (0x0010)
#define LCDBLKPRE__16384                 (0x0014)        /* Divide by 16384 */
#define LCDBLKPRE__16384_L               (0x0014)
#define LCDBLKPRE__32768                 (0x0018)        /* Divide by 32768 */
#define LCDBLKPRE__32768_L               (0x0018)
#define LCDBLKPRE__65536                 (0x001c)        /* Divide by 65536 */
#define LCDBLKPRE__65536_L               (0x001c)
#define LCDBLKDIV                        (0x00e0)        /* Clock divider for blinking frequency */
#define LCDBLKDIV_L                      (0x00e0)
#define LCDBLKDIV0                       (0x0020)        /* Clock divider for blinking frequency */
#define LCDBLKDIV0_L                     (0x0020)
#define LCDBLKDIV1                       (0x0040)        /* Clock divider for blinking frequency */
#define LCDBLKDIV1_L                     (0x0040)
#define LCDBLKDIV2                       (0x0080)        /* Clock divider for blinking frequency */
#define LCDBLKDIV2_L                     (0x0080)
#define LCDBLKDIV_0                      (0x0000)        /* Divide by 1 */
#define LCDBLKDIV_1                      (0x0020)        /* Divide by 2 */
#define LCDBLKDIV_1_L                    (0x0020)
#define LCDBLKDIV_2                      (0x0040)        /* Divide by 3 */
#define LCDBLKDIV_2_L                    (0x0040)
#define LCDBLKDIV_3                      (0x0060)        /* Divide by 4 */
#define LCDBLKDIV_3_L                    (0x0060)
#define LCDBLKDIV_4                      (0x0080)        /* Divide by 5 */
#define LCDBLKDIV_4_L                    (0x0080)
#define LCDBLKDIV_5                      (0x00a0)        /* Divide by 6 */
#define LCDBLKDIV_5_L                    (0x00a0)
#define LCDBLKDIV_6                      (0x00c0)        /* Divide by 7 */
#define LCDBLKDIV_6_L                    (0x00c0)
#define LCDBLKDIV_7                      (0x00e0)        /* Divide by 8 */
#define LCDBLKDIV_7_L                    (0x00e0)
#define LCDBLKDIV__1                     (0x0000)        /* Divide by 1 */
#define LCDBLKDIV__2                     (0x0020)        /* Divide by 2 */
#define LCDBLKDIV__2_L                   (0x0020)
#define LCDBLKDIV__3                     (0x0040)        /* Divide by 3 */
#define LCDBLKDIV__3_L                   (0x0040)
#define LCDBLKDIV__4                     (0x0060)        /* Divide by 4 */
#define LCDBLKDIV__4_L                   (0x0060)
#define LCDBLKDIV__5                     (0x0080)        /* Divide by 5 */
#define LCDBLKDIV__5_L                   (0x0080)
#define LCDBLKDIV__6                     (0x00a0)        /* Divide by 6 */
#define LCDBLKDIV__6_L                   (0x00a0)
#define LCDBLKDIV__7                     (0x00c0)        /* Divide by 7 */
#define LCDBLKDIV__7_L                   (0x00c0)
#define LCDBLKDIV__8                     (0x00e0)        /* Divide by 8 */
#define LCDBLKDIV__8_L                   (0x00e0)

